Tekla Open API Reference for Tekla Structures 2025
HyperLink Properties
The HyperLink type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the angle of the link.
 (Inherited from LinkBase.)
Attributes
 Gets or sets the link attributes.
 (Inherited from LinkBase.)
InsertionPoint
 Gets or sets the insertion point of the link.
 (Inherited from LinkBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Target
 Gets or sets the target.
Text
 Gets or sets the link text that is visible on the screen.
 (Inherited from LinkBase.)
Top
See Also
Reference
HyperLink Class
Tekla.Structures.Drawing Namespace